##############家人们投一下币，点一下关注吧！！
##############QQ群：1121444037  为了防止有人进来打广告，请不要使用小号加群！！！管理员可能不会给你通过！
##############由于QQ群开放讨论，请注意防骗。
##############2023-1-10
##############所有课程都是紧密联系的，如果没看过之前的课程请不要观看这节课！！！！
##############以后的课用到的R语言技能都是基础篇和中级篇学过的！没有任何R基础纯粹想套代码的话，建议放弃。
##############出课程的目的一是给大家快速入门R语言，二用来纪录我自己的学习内容。
##############------------------------------分割线----------------------------------------------############
##############--------------------------项目实战课-生存资料的下载和处理-----------------------------########################################
##############设置工作目录
setwd('D:\\R\\正式科研代码')
library(TCGAbiolinks)
query <- GDCquery(project = "TCGA-STAD", 
                  data.category = "Clinical", 
                  file.type = "xml")
GDCdownload(query)
save(query,file = 'query.Rda')

clinical <- GDCquery_clinic(project = "TCGA-STAD", type = "clinical")

